In [2]:
import pandas as pd
import numpy as np
from ipywidgets import interact
import random

In [12]:
s = pd.Series(
    np.random.random(5),
    index = ['a', 'b', 'c', 'd', 'e'],
    name = 'name'
)
s

a    0.763533
b    0.230807
c    0.537782
d    0.996959
e    0.100968
Name: name, dtype: float64

In [35]:
base_dict = {1:'first', 2:'second', 3:'third', 4:'fourth'}
s2 = pd.Series(base_dict)
s2

1     first
2    second
3     third
4    fourth
dtype: object

In [13]:
type(s)

pandas.core.series.Series

In [15]:
s.values

array([0.76353277, 0.23080727, 0.53778242, 0.99695899, 0.10096784])

In [16]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [17]:
s['a']

0.7635327740096761

In [18]:
s[:3]

a    0.763533
b    0.230807
c    0.537782
Name: name, dtype: float64

In [19]:
s['c'] = 1
s

a    0.763533
b    0.230807
c    1.000000
d    0.996959
e    0.100968
Name: name, dtype: float64

In [20]:
s > 0.5

a     True
b    False
c     True
d     True
e    False
Name: name, dtype: bool

In [21]:
s + 5

a    5.763533
b    5.230807
c    6.000000
d    5.996959
e    5.100968
Name: name, dtype: float64

In [31]:
s = s * 5

a   -2386.039919
b     721.272705
c   -3125.000000
d   -3115.496856
e     315.524515
Name: name, dtype: float64

In [38]:
s2 * 5

1         firstfirstfirstfirstfirst
2    secondsecondsecondsecondsecond
3         thirdthirdthirdthirdthird
4    fourthfourthfourthfourthfourth
dtype: object

In [32]:
s[s>0.5] *= -1
s

a   -2386.039919
b    -721.272705
c   -3125.000000
d   -3115.496856
e    -315.524515
Name: name, dtype: float64

In [33]:
s.abs()

a    2386.039919
b     721.272705
c    3125.000000
d    3115.496856
e     315.524515
Name: name, dtype: float64

In [70]:
unique_value = pd.Series([3,5,7,3,3,7,9,4,4,9,3,5,9])
unique_value

0     3
1     5
2     7
3     3
4     3
5     7
6     9
7     4
8     4
9     9
10    3
11    5
12    9
dtype: int64

In [53]:
unique_value.unique()

array([3, 5, 7, 9, 4], dtype=int64)

In [77]:
@interact(x=4)
def func1(x):
    return 4 * x

interactive(children=(IntSlider(value=4, description='x', max=12, min=-4), Output()), _dom_classes=('widget-in…

In [78]:
interact(func1, x = s2.values);

interactive(children=(Dropdown(description='x', options=('first', 'second', 'third', 'fourth'), value='first')…

In [83]:
@ipywidgets.interact_manual()
def random_value():
#     unique_value = pd.Series([3,5,7,3,3,7,9,4,4,9,3,5,9])
    print(random.choice(unique_value))

interactive(children=(Button(description='Run Interact', style=ButtonStyle()), Output()), _dom_classes=('widge…

In [5]:
df = pd.read_csv('data.csv')
df

      id  count  price  basic price
0  f266h    300   23.1         20.1
1  dj85d    125   55.0         50.1
2  sh74d    111   66.8         52.5
3  d5fhd     22   12.0         11.1
4  a45fg    266   78.8         65.4
5  g67hd     23   33.8         26.8

In [6]:
df.shape

(6, 4)

In [129]:
df.columns

Index(['id', 'count', 'price', 'basic price'], dtype='object')

In [7]:
df['id']

0    f266h
1    dj85d
2    sh74d
3    d5fhd
4    a45fg
5    g67hd
Name: id, dtype: object

In [131]:
df.head(2)

      id  count  price  basic price
0  f266h    300   23.1         20.1
1  dj85d    125   55.0         50.1

In [146]:
df.tail(2)

      id  count  price  basic price
4  a45fg    266   78.8         65.4
5  g67hd     23   33.8         26.8

In [145]:
df.sort_values('price')

      id  count  price  basic price
3  d5fhd     22   12.0         11.1
0  f266h    300   23.1         20.1
5  g67hd     23   33.8         26.8
1  dj85d    125   55.0         50.1
2  sh74d    111   66.8         52.5
4  a45fg    266   78.8         65.4

In [153]:
df.loc[0, 'price']

23.1

In [162]:
df.set_index('id', inplace=True)
df

       count  price  basic price
id
f266h    300   23.1         20.1
dj85d    125   55.0         50.1
sh74d    111   66.8         52.5
d5fhd     22   12.0         11.1
a45fg    266   78.8         65.4
g67hd     23   33.8         26.8

In [163]:
filt=df['price']>20
filt.head(10)

id
f266h     True
dj85d     True
sh74d     True
d5fhd    False
a45fg     True
g67hd     True
Name: price, dtype: bool

In [164]:
df.reset_index(inplace=True)
df

      id  count  price  basic price
0  f266h    300   23.1         20.1
1  dj85d    125   55.0         50.1
2  sh74d    111   66.8         52.5
3  d5fhd     22   12.0         11.1
4  a45fg    266   78.8         65.4
5  g67hd     23   33.8         26.8

In [8]:
filt = (df['count']>150) | (df['price']==50.0 ) 
filt

0     True
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [9]:
def func3(x):
    return df[x].values
interact(func3, x = df.columns)

interactive(children=(Dropdown(description='x', options=('id', 'count', 'price', 'basic price'), value='id'), …